---
type: MEPSystemType
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# MEPSystemType

`Autodesk.Revit.DB.MEPSystemType` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Abbreviation | 2012 | `public string Abbreviation { get ; set ; }` |
| Property | CalculationLevel | 2012 | `public SystemCalculationLevel CalculationLevel { get ; set ; }` |
| Property | FillColor | 2012 | `public Color FillColor { get ; set ; }` |
| Property | FillPatternId | 2012 | `public ElementId FillPatternId { get ; set ; }` |
| Property | FillVisible | 2012 | `public bool FillVisible { get ; set ; }` |
| Property | LineColor | 2012 | `public Color LineColor { get ; set ; }` |
| Property | LinePatternId | 2012 | `public ElementId LinePatternId { get ; set ; }` |
| Property | LineWeight | 2012 | `public int LineWeight { get ; set ; }` |
| Property | MaterialId | 2012 | `public ElementId MaterialId { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | SystemClassification | 2012 | `public MEPSystemClassification SystemClassification { get ; }` |